<?php
/*
 * +----------------------------------------------------------------------
 * | Presty Framework
 * +----------------------------------------------------------------------
 * | Copyright (c) 20021~2022 Confidire All rights reserved.
 * +----------------------------------------------------------------------
 * | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
 * +----------------------------------------------------------------------
 * | Email: 790455692@qq.com
 * +----------------------------------------------------------------------
 */
return [
    //应用初始化
    "appInit" => [],
    //自动加载每次被触发后(第一次触发不会调用)
    "afterAutoload" => [],
    //路由初始化
    "routerInit" => [],
    //路由解析后
    "afterRouter" => [],
    //模板引擎初始化
    "viewInit" => [],
    //匹配页面内容关键词前
    "beforeParseFile" => [],
    //匹配页面内容关键词后
    "afterParseFile" => [],
    //页面渲染前
    "beforeRender" => [],
    //日志写入前
    "beforeLogWrite" => [],
    //应用销毁前
    "appDestroy" => [],
];